Tekla Open API Reference for Tekla Structures 2025
TextFile Constructor (ViewBase, Point, String)
 Creates a new text file instance using standard attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public TextFile(
	ViewBase view,
	Point insertionPoint,
	string fileName
)
Public Sub New (
	view As ViewBase,
	insertionPoint As Point,
	fileName As String
)
Parameters
view
Type: Tekla.Structures.Drawing.ViewBase
The view for the object.
insertionPoint
Type: Tekla.Structures.Geometry3d.Point
The location of the object.
fileName
Type: System.String
The name of the referenced text file.
See Also
Reference
TextFile Class
TextFile Overload
Tekla.Structures.Drawing Namespace